Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: གཞོན་ནུའི་གཟུགས་ཅན་གྱི་འཁོར་ལ་ལྟ་བའོ། །
en: He possesses the beauty of a youth and looks upon the maṇḍala.

source: ཤར་ཕྱོགས་སུ་ནི་ནམ་མཁའ་ལྡིང་འདབ་ཆགས་ཀྱི་གཟུགས་ཅན་དང་། དྲང་སྲོང་གི་ནང་ནས་མར་ཀ་ཎ་ཌ་ངེས་པར་བྲི་བར་བྱའོ། །
en: Vainateya, who has the form of a bird, should always be painted in the eastern quarter, along with the sage Mārkaṇḍa.

source: ལྷག་མ་ནི་ཇི་ལྟར་གནས་པ་བཞིན་ཕྱག་རྒྱར་བྲི་བར་བྱའོ། །
en: The rest should be represented by their respective mudrās. {2.168}

source: ཤར་ལྷོར་ནི་གཞོན་ནུ་མ་བཞི་དང་། མིང་པོ་གཞོན་ནུ་དང་བཅས་པ། གྲུའི་བཞོན་པ་ལ་གནས་པ། རྒྱ་མཚོ་ཆེན་པོ་ལ་རྣམ་པར་རྒྱུ་བ་དང་།
en: “In the southeastern division should be the four girls of royal bearing together with their brothers, the divine youths. They are aboard boats, traveling around the great ocean.

source: མེ་ལྷའི་རྒྱལ་པོ་ཡང་ངེས་པར་བྲི་བར་བྱའོ། །
en: Also Agni, the lord of gods, should always be painted in the same area of the maṇḍala.

source: དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་སུ་ནི་སྲིན་པོའི་བདག་པོ་ལས་ནི་གྲོང་ཁྱེར་ལང་ཀའི་བདག་པོ་བི་བྷི་ཤ་ན་ཤིང་པི་ཙུ་མརྡ་ལ་གནས་པ་དང་། ཛམ་བྷ་ལ་ཆུ་དབང་ཞེས་བྱ་བ་གནོད་སྦྱིན་གྱི་གཟུགས་ཅན་བྱང་ཆུབ་སེམས་དཔའ་ངེས་པར་བྲི་བར་བྱའོ། །
en: Also in the southern quarter should be painted Vibhīṣaṇa, the king of rākṣasas, in the country of Laṅkā. Also located there, dwelling in a neem tree, is the bodhisattva named Jambhala, the Lord of Waters, who has the form of a yakṣa.

source: དེ་བཞིན་དུ་མཐར་གྱིས་གཤིན་རྗེའི་རྒྱལ་པོ་ཡི་དགས་རྫུ་འཕྲུལ་ཆེན་པོ་ངེས་པར་བྲི་བར་བྱའོ། །
en: Painted next in the same sequence should be the king Yama, a preta of great power.

source: དེ་བཞིན་དུ་ཤ་ཟའི་རྒྱལ་པོ་རྣམ་པར་གཡེངས་བྱེད་ཅེས་བྱ་བ་ངེས་པར་བྲི་བར་བྱའོ། །
en: So too the king of piśācas named Vikarāla.

source: དེ་བཞིན་དུ་ལྷོ་ནུབ་ཀྱི་མཚམས་སུ་ནི་ཀླུའི་གཙོ་བོ་དགའ་བོ་དང་། ཉེ་དགའ་བོ་ངེས་པར་བྲི་བར་བྱའོ། །
en: “Similary, the two chief nāga s, Nanda and Upananda, and also

source: གཟའི་གཙོ་བོ་ཉི་མ་བྲི་བར་བྱའོ། །
en: Āditya, the chief among celestial bodies, must be painted in the southwestern division.

source: ནུབ་ཕྱོགས་སུ་ནི་དྲང་སྲོང་ཐུབ་པའི་མཆོག་གཅེར་བུ་པ་མུ་སྟེགས་ཀྱི་མཆོག་གཅེར་བུའི་གཟུགས་བྲི་བར་བྱའོ། །
en: The best of ṛṣis, the sage named Kapila, should be in the western quarter. The preeminent one among non-Buddhists, he should have the form of a naked mendicant.

source: ལྷག་མ་ནི་ཅི་ལྟར་གནས་པ་བཞིན་ཕྱག་རྒྱར་བྲི་བར་བྱའོ། །
en: The remaining ones should be represented by their respective mudrās, arranged in a proper order. {2.170}

source: ནུབ་བྱང་མཚམས་སུ་ནི་གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་མཆོག་སྦྱིན་དང་། དྲི་ཟའི་རྒྱལ་པོ་གཙུག་ཕུད་ལྔ་པ་དང་། མིའམ་ཅིའི་རྒྱལ་པོ་ལྗོན་པ་ངེས་པར་བྲི་བར་བྱའོ། །
en: “In the northwestern division should be the king of yakṣa s Dhanada, the king of gandharvas Pañcaśikha, and the king of kinnaras Druma.

source: ལྷག་མ་ནི་གནས་ཇི་ལྟ་བ་དང་། དབྱིབས་ཅི་ལྟ་བ་བཞིན་དུ་ཕྱག་རྒྱར་བྲི་བར་བྱའོ། །
en: The remaining ones should be represented by their respective mudrās and arranged in sequence according to their respective places. {2.171}

source: དཀྱིལ་འཁོར་བཞི་པོ་ཕྱི་རོལ་དུ་རི་མོ་ལྔར་བཀོད་དེ། ཕྱག་རྒྱའི་ཕྲེང་བས་ཉེ་བར་མཛེས་པར་བྱས་པ།
en: “Outside the third maṇḍala there should be a fourth, comprised of five concentric zones and adorned with rows of mudrās.

source: ཟུར་བཞི་ནས་རྟ་བབས་བཞི་དང་རྒྱལ་པོ་ཆེན་པོ་བཞིས་བརྒྱན་པ་ཅི་ལྟར་གནས་པ་ལ་འདི་ལྟ་སྟེ།
en: It has four sides, each including a gateway graced with [one of] the four great kings.

source: ཕྱག་རྒྱར་འགྱུར་བ་ནི་སྒོར་འཇུག་པ་ལ་ཨུཏྤལ་སྔོན་པོ་བྲིའོ། །
en: The emblems are arranged in the following order: {2.172} “At the entrance gate in the east should be painted a blue lotus.

source: གཡས་དང་གཡོན་གྱི་ཕྱོགས་སུ་ནི་པདྨ་རྡོ་རྗེ་དགྲ་སྟ། རལ་གྲི་མདུང་དང་མདུང་རྩེ་གསུམ་པ་དང་། ག་དཱ་དང་འཁོར་ལོ་དང་སྭ་སྟི་ཀ་དང་། བུམ་པ་དང་། ཉ་དང་། དུང་དང་། གདུབ་ཀོར་དང་། སྤྱི་བླུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། ཞགས་པ་དང་། དྲིལ་བུ་དང་། ཆུ་གྲི་དང་། གཞུ་དང་། ཐོ་བ་དང་།
en: From right to left, there should be a lotus, vajra, axe, sword, trident, mace, discus, swastika, water jar, fish, conch, earring, banner, flag, noose, bell, dagger, bow, arrow, and hammer.

source: འདི་དག་རྣམ་པ་འདི་དག་འདྲ་བའི་མཚོན་ཆའི་མཆོག་གི་ཕྱག་རྒྱས་དཀྱིལ་འཁོར་གྱི་ཕྱོགས་སུ་ཀུན་ནས་ཁྱབ་པར་བྱའོ། །
en: All four of the maṇḍala’s sides should be filled with rows of symbols ( mudrā ) [representing] these various weapons and implements.

source: དེ་ནས་ཕྱི་རོལ་གྱི་ཕྱོགས་བཞིར་རྒྱ་མཚོ་ཆེན་པོ་གཞག་པར་བྱ་སྟེ།
en: Outside all of this, in the four directions, should be placed the four great oceans. {2.173}

source: བྱང་ཕྱོགས་སུ་ནི་དཀྱིལ་འཁོར་གྲུ་བཞིར་བྱ་སྟེ། སྣ་ཚོགས་རྡོ་རྗེ་རྩེ་གསུམ་ཡོད་པ་ཀུན་ནས་འབར་བ་བྱའོ། །
en: “In the northern direction should be drawn a small four-sided maṇḍala, within which is placed a three-pronged double vajra that radiates blazing light.

source: ཤར་ཕྱོགས་སུ་ནི་དཀྱིལ་འཁོར་གཞུའི་དབྱིབས་ཅན་བྱས་ཏེ་བཞག་ལ་ཀུན་ནས་འབར་བའི་པདྨའི་ཕྱག་རྒྱས་མཚན་པའོ། །
en: In the eastern direction should be drawn a small triangular maṇḍala, within which is placed a lotus that radiates blazing light.

source: ལྷོ་ཕྱོགས་སུ་ནི་དཀྱིལ་འཁོར་ཟུར་གསུམ་པ་བྱས་ཏེ་ཀུན་ནས་འབར་བའི་ལྷུང་བཟེད་ཀྱིས་མཚན་པའོ། །
en: In the southern direction should be drawn a small bow-shaped maṇḍala, within which is placed a bowl that radiates blazing light.

source: ནུབ་ཕྱོགས་སུ་ནི་དཀྱིལ་འཁོར་ཀུན་ནས་ཟླུམ་པོར་བྱས་ཏེ། ཨུཏྤ་ལ་སྔོན་པོ་སྡོང་བུ་དང་འདབ་མ་དང་བཅས་པ་ཀུན་ནས་འབར་བས་མཚན་པའོ། །
en: In the western direction should be drawn a small maṇḍala entirely made of light, within which is placed a blue lotus complete with a stalk and leaves and radiating blazing light. {2.174}

source: ཕྱོགས་མཚམས་བཞིར་ཡང་ཕྱག་རྒྱ་བྲི་བར་བྱ་སྟེ། ནུབ་བྱང་གི་ཕྱོགས་སུ་ནི་དཀྱིལ་འཁོར་ཟླུམ་པོ་བྱ་སྟེ། ཞགས་པ་ཀུན་ནས་འབར་བས་མཚན་པའོ། །
en: “In the four intermediate directions should be the following four mudrās, each of them blazing with light all around: A noose should be placed in the northwestern direction, within a round maṇḍala.

source: ལྷོ་ནུབ་མཚམས་སུ་ནི་དཀྱིལ་འཁོར་གཞུ་འདྲ་བ་བྱ་སྟེ་དབྱུག་པ་ཀུན་ནས་འབར་བས་མཚན་པའོ། །
en: A staff should be placed in the southwestern direction, within an elongated maṇḍala.

source: ཤར་ལྷོ་མཚམས་སུ་ནི་དཀྱིལ་འཁོར་གྲུ་གསུམ་པ་བྱ་སྟེ། དགྲ་སྟ་འོད་ཟེར་ཀུན་ནས་འབར་བས་མཚན་པའོ། །
en: An axe should be placed in the southeastern direction, within a triangular maṇḍala.

source: བྱང་ཤར་གྱི་མཚམས་སུ་ནི་རལ་གྲི་འོད་ཀུན་ནས་འབར་བ་གཞག་པར་བྱའོ། །
en: A sword should be placed in the northeastern direction. {2.175}

source: དེ་ལྟར་ཐམས་ཅད་བྲིས་ནས་སྟེང་དང་འོག་དང་ཐད་ཀར་ཕྱག་རྒྱ་གསུམ་དཀྱིལ་འཁོར་གྱི་ཕྱི་རོལ་སྒོ་དང་ཉེ་བར་ཕྱེ་མ་དང་བྲི་བར་བྱ་ལ་འདི་ལྟ་སྟེ།
en: “When all this has been drawn, three mudrās should be traced with colored powders outside the gate of the main maṇḍala: one above, one below, and one at the same level.

source: ན་བཟའ་དང་རྔ་ཡབ་དང་ལྷམ་འོད་ཟེར་ཀུན་ནས་འབར་བ་བྲི་བར་བྱའོ། །
en: The three mudrās to be painted are clothes, a fly-whisk, and a pair of shoes, each surrounded by blazing light.” {2.176}

source: འཇམ་པའི་དབྱངས་ནི་བློ་ཅན་གྱིས། །སེམས་ཅན་རྣམས་ལ་ཕན་བཞེད་ནས། །དཀྱིལ་འཁོར་གྱི་ནི་ཆོ་ག་རྣམས། །འདིར་ནི་མདོར་བསྡུས་བསྟན་པ་ཡིན། །
en: This maṇḍala procedure Has been taught here in brief By the wise Mañjughoṣa, Out of his desire to benefit beings. {2.177}

source: དེ་ནས་དཀྱིལ་འཁོར་གྱི་སློབ་དཔོན་གྱིས་དང་པོ་ཉིད་དུ་སློབ་མ་གཟུང་བར་བྱ་བྱ་བ་ལ།
en: “Then, the maṇḍala master should first of all select the right disciples.

source: དབང་པོ་མ་ཚང་བ་མེད་པ་དང་ཡན་ལག་ཐམས་ཅད་མཛེས་པ་དང་། བྲམ་ཟེ་དང་རྒྱལ་རིགས་དང་རྗེའུ་རིགས་དང་དམངས་རིགས་དང་། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དང་། ཐེག་པ་ཆེན་པོར་ཞུགས་པའི་རང་བཞིན་ཅན་དང་ཐེག་པ་དམན་པ་མི་འདོད་པའི་ངང་ཚུལ་ཅན་དང་། སེམས་དཔའ་ཆེན་པོ་དང་དད་པ་དང་ལྡན་པ་དང་། དགེ་བའི་ཆོས་ཅན་དང་རྒྱལ་པོ་ཆེན་པོ་མངོན་པར་འདོད་པ་དང་ལོངས་སྤྱོད་ཆུང་བ་ལ་སྨོད་པ་དང་། ལོངས་སྤྱོད་ཆེན་པོ་མངོན་པར་འདོད་པ་དང་ལྡན་པ་དང་། བཟང་བ་དག་དང་དུལ་བ་དང་ལྡན་པ་དང་། ཚུལ་ཁྲིམས་དང་ལྡན་པའི་དགེ་སློང་དང་དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་དགེ་བསྙེན་མ་རྣམས་ཡང་དག་པར་སྡོམ་པ་ལ་ངེས་པར་གནས་པ་དང་། གསོ་སྦྱོང་ལ་ཉེ་བར་གནས་ཤིང་སྡོམ་པ་ལ་གནས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་ལ་ཞེ་མི་སྡང་བ་དང་། ཕྱོགས་ཆེན་པོ་དང་རིགས་མཐོན་པོ་དང་རང་བཞིན་ཉིད་ཀྱིས་ཆོས་སྤྱོད་པ་དང་ཞག་གཅིག་སྨྱུང་བ་བྱས་པ་དང་། གོས་གཙང་མ་བགོས་པ་དང་སྐྲ་དྲི་ཞིམ་པ་དང་། དུས་གསུམ་དུ་ཁྲུས་བྱེད་པ་དང་། དེའི་ཉིན་ཞག་ལ་ག་པུར་དང་གུར་གུམ་དང་ལི་ཤི་ལ་ཝང་གའི་དྲི་ཞིམ་པོས་དྲི་ཞིམ་པར་བྱས་པ། རྟག་ཏུ་ཉེ་རེག་དང་ལྡན་པ་དང་། ཀུ་ཤའི་ཁྲེས་ལ་འདུག་པ་དང་སྲུང་བའི་ཆོ་ག་བྱས་པ་དང་། ཚངས་པར་སྤྱོད་པ་དང་བདེན་པ་དང་ལྡན་པ་དང་དུས་མཚམས་ལས་རྒྱལ་བའི་དཀྱིལ་འཁོར་གྱི་ཕྱི་རོལ་དེ་ཉིད་དུ་ཧ་ཅང་ཡང་མི་ཉེ་ཧ་ཅང་མི་རིང་བར་གཞག་པར་བྱའོ། །
en: They should have unimpaired faculties and bodies beautiful in every limb; should belong to the brahmin, kṣatriya, vaiśya, or śūdra castes; should have developed bodhicitta; should be followers of the Great Vehicle; should possess discipline that is not related to other vehicles; should be great beings (bodhisattvas); should have faith and follow the auspicious Dharma; should wish for the great kingship; should shun trivial enjoyments but delight in the great ones; should be gracious, well mannered, and disciplined; should be monks or nuns, or male or female lay practitioners; should observe their particular rules, fasts, and ritual observances; should abide by their vows of conduct; should not harbor hatred for great bodhisattvas; should belong to a spiritual family of many adherents; and should have a natural inclination to practice Dharma. {2.178} “They will have fasted for one day and one night, put on clean clothes, nicely scented their hair, bathed three times, and observed silence. On the day of the empowerment, they should perfume their mouths with the fragrances of camphor, saffron, and cloves, and, after the regular performance of ritual besprinkling, they should sit on bundles of kuśa grass and have the protection ceremony performed for them. Celibate and committed to truth, they should be placed outside the maṇḍala Victorious over the Divisions of Time, not too far from it and not too near to it.

source: ཤིན་ཏུ་གཙང་བ་དང་ཤིན་ཏུ་གཙང་སྦྲ་དང་ལྡན་པ་གཅིག་ནས་བརྒྱད་ཀྱི་བར་ཏེ་དེ་ལས་གཞན་མ་ཡིན་པ་དེ་དག་ཀྱང་ཕན་ཚུན་གཉེན་དུ་འབྲེལ་བ།
en: Clean and ritually purified, they should number no more than between one and eight and be close associates of one another.

source: རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོ་ཆེན་པོ་དག་གི་བུ་གཞོན་ནུ་མའམ་གཞོན་ནུ་མ་གྲོང་གི་ཆོས་མི་ཤེས་པའོ། །
en: They will include kṣatriyas who are closely associated with one another and great kings who have had their heads anointed, as well as their offspring—the princes and princesses who have not yet experienced sex.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། བཅོམ་ལྡན་འདས་གཞོན་ནུའི་གཟུགས་ཅན་བྱང་ཆུབ་སེམས་དཔའ་འཇམ་དཔལ་ནི་བྱིས་པའི་སྐྱེ་བོ་དགའ་བར་བྱེད་པ། གཞོན་ནུའི་རོལ་པ་ལ་དགྱེས་པ་དེས་ན་དང་པོ་ཉིད་དུ་གཞོན་ནུ་ནང་དུ་གཞུག་པར་བྱའོ། །
en: This is because Lord Mañjuśrī, the great bodhisattva in a youthful form, loves to engage in youthful play, awakening foolish people to realization. {2.179}

source: རྒྱལ་པོ་ཆེན་པོ་མངོན་པར་འཕེལ་བ་དང་ཚེ་དང་ནད་མེད་པ་དང་།
en: “Consequently, it is the princely youths who should be ushered in first.

source: དབང་ཕྱུག་དང་སྐལ་བ་ཆེན་པོ་མངོན་པར་འཕེལ་བ་ཡིན་ཏེ།
en: This will elevate their regal status and promote long life, health, power, and the ability to savor sensual enjoyments.

source: ཁྱད་པར་དུ་བྱིས་པ་རྣམས་ལ་ངེས་པར་སྔགས་གྲུབ་པས་གྲུབ་པ་གནས་པ་ཡིན་ཏེ།
en: In particular, this will stabilize the accomplishment of mantra for them, the inexperienced. {2.180}

source: དེ་དག་སྔར་བཞག་པ་བྱས་ནས། གྲོགས་པོ་བག་ཡོད་པ་བཟང་པོ་དང་ལྡན་པས། དཀྱིལ་འཁོར་གྱི་སློབ་དཔོན་གྱིས་ག་པུར་གྱི་བདུག་པས་བདུགས་ཏེ། རྒྱབ་ཀྱིས་ཕྱོགས་པ་མ་ཡིན་པས་ཕྱི་རོལ་དུ་བྱུང་བར་བྱ་སྟེ།
en: “Once they are positioned in front, assigned an assistant, and attentive, the maṇḍala master should exit backward while burning incense of camphor.

source: བྱུང་ནས་དུས་དང་ཅི་ལྟར་མཐུན་པའི་ཆུ་ལེགས་པར་གཙང་སྦྲ་བྱས་པ་དང་། སྲོག་ཆགས་མེད་པ་ལ་རྩ་བའི་སྔགས་བརྒྱ་རྩ་བརྒྱད་མངོན་པར་བཟླས་ཏེ། གཙུག་ཕུད་ལྔའི་ཕྱག་རྒྱ་ཆེན་པོས་ཕྱག་རྒྱར་བྱས་པའི་ཆུས་ཁྲུས་བྱས་ལ་ཉེ་རེག་བྱས་ནས།
en: After exiting, he should bathe and besprinkle himself, as convenient for the season, with water that has been incanted one hundred and eight times with the root mantra and sealed with the great mudrā called five-crested .

source: གོས་གཙང་མ་བགོས་པའི་གཙང་བས་མེ་ཐབ་ཀྱི་དྲུང་དུ་སོང་སྟེ།
en: Dressed in clean white clothes, he should then approach the sacrificial fire pit, and, {2.181}

source: ཀུ་ཤའི་ཁྲེས་ལ་འདུག་ནས་བྱང་ཤར་གྱི་ཕྱོགས་སུ་མངོན་པར་བལྟས་ཏེ། མར་གྱི་སྦྱིན་སྲེག་ག་པུར་དང་གུར་གུམ་དང་། ཙནྡན་དང་བསྲེས་པས་སྟོང་རྩ་བརྒྱད་བྱའོ། །
en: “Seated on the bundles of kuśa grass and facing northeast, He should offer into the fire One thousand and eight oblations consisting of Camphor, saffron, and sandalwood mixed together. {2.182}

source: སྔར་བཤད་པའི་ཆོ་གས་སྤྱན་དྲང་བ་དང་གཤེགས་སུ་གསོལ་བ་བྱས་ཏེ། ཡང་དཀྱིལ་འཁོར་དུ་འཇུག་པར་བྱའོ། །
en: “Having summoned and then dismissed the deities according to the previously described procedure, he should again enter the maṇḍala.

source: ངེས་པར་ཡང་བུམ་པ་གང་བ་བརྒྱད་རས་གཙང་མའི་གོས་དང་ལྡན་པ། ཤིང་ཨ་མྲའི་ལོ་མ་དང་འབྲས་བུ་དང་ལྡན་པ་གསེར་དང་། དངུལ་དང་རིན་པོ་ཆེ་དང་། འབྲས་དང་འབྲུ་ནང་དུ་བཅུག་པ་གཅིག་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་དབུལ་ལོ། །
en: After entering he should prepare eight full vases draped in clean cloth, adorned with mango blossoms, and containing gold, silver, gems, grain, and rice. He should allocate the first to Lord Śākyamuni,

source: གཉིས་པ་ནི་སངས་རྒྱས་ཐམས་ཅད་ལའོ། །
en: the second to all the buddhas,

source: གསུམ་པ་ནི་རང་སངས་རྒྱས་ཐམས་ཅད་དང་འཕགས་པ་ཉན་ཐོས་ལའོ། །
en: the third to all the pratyeka­buddhas and the noble congregation of the śrāvakas,

source: བཞི་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་ལའོ། །
en: the fourth to all the great bodhisattvas,

source: ལྔ་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་འཇམ་དཔལ་ལའོ། །
en: the fifth to the great bodhisattva Mañjuśrī,

source: དྲུག་པ་ནི་ལྷ་ཐམས་ཅད་ལའོ། །
en: and the sixth to all the gods.

source: བདུན་པ་དང་བརྒྱད་པ་ནི་དཀྱིལ་འཁོར་གཉིས་པའི་སྒོ་ཁང་ལ་གཞག་པར་བྱ་སྟེ། །
en: The seventh and the eighth should be placed in the niches by the gate of the second maṇḍala. They should be draped in clean white cloth.

source: གཅིག་ནི་འབྱུང་པོ་ཐམས་ཅད་ལའོ། །
en: One of them should be assigned to all the spirits,

source: གཅིག་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐུན་མོང་དུ་གྱུར་པར་བསྔོས་ནས་གཞག་པར་བྱའོ། །
en: and the second should be dedicated to all beings equally. {2.183}

source: དེ་བས་ན་སྔར་བཤད་པའི་ཆོ་གས་སྤྱན་དྲང་བར་བྱའོ། །
en: “Then, following the previously described procedure,

source: དེ་བཞིན་དུ་མེ་ཏོག་དང་བདུག་པ་དང་དྲི་དང་། མར་མེ་དང་ལྷ་བཤོས་ཀྱང་སྔར་བསྟན་པ་ཉིད་ཀྱི་ལས་ཀྱིས་དབུལ་བར་བྱ་སྟེ།
en: “Similarly, he should offer, in a ritual as previously described, flowers, incense, fragrances, light, and foodstuffs;

source: ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་གོ་རིམས་བཞིན་དུ་བྱའོ། །
en: he should offer all this to all the recipients, thoroughly and in the right order.

source: མར་མེ་འཛིན་པས་མར་གྱི་མར་མེ་གཟུང་བར་བྱའོ། །
en: For the offering of light, he should offer butter lamps.

source: འཕགས་པ་དང་འཕགས་པ་མ་ཡིན་པ་ཐམས་ཅད་ལ་ལྷ་བཤོས་ཞེས་སྨོས་པ་ནི། འབྲས་སཱ་ལུའི་ཆན་ཞོ་དང་བཅས་པ་དང་སྦྲང་རྩི་དང་ལྡན་པའི་འོ་ཐུག་ཁྱད་པར་ཅན་གྱིས་ཉེ་བར་སྦྱར་བའི་མར་ལ་བཙོས་པའི་སྣུམ་ཁུར་གྱི་འབྲེང་བུ་ལ་སོགས་པ་དང་། ཁཎྜ་ལ་སོགས་པའི་བཟའ་བ་ཐམས་ཅད་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་དབུལ་བར་བྱའོ། །
en: When offering food to all the noble recipients and others, he should offer rice pudding with curds. {2.185} “To all the tathāgatas he should offer cakes rich particularly in honey and milk and fried in butter, as well as pastry-rolls ( vartī ), candies ( khaṇḍa ), and other delicacies.

source: མར་གྱིས་གང་བ་དང་ཙནྡན་གྱི་ཐང་ཆུ་སྦྲང་རྩིའི་སྙིང་པོ་དང་འོ་མར་བཙོས་པའི་བཟའ་བ་ནི་རང་སངས་རྒྱས་ཐམས་ཅད་དང་། འཕགས་པ་ཉན་ཐོས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་དང་འཕགས་པའི་ལྷ་ཐམས་ཅད་ལ་དབུལ་བར་བྱའོ། །
en: To all the pratyeka­buddhas, noble śrāvakas, great bodhisattvas, and the noble deities he should offer dishes prepared with honey and cooked in milk, rich in butter, and flavored with chir pine resin.

source: དེ་བཞིན་དུ་གརྦྷོད་ཨུ་ལོ་པི་ཀ་རི་ཀ་དང་། ཁྱད་པར་དུ་སྣུམ་ཁུར་གྱི་ཡོ་བྱད་འབྱུང་པོ་ཐམས་ཅད་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་སྔགས་དང་ལྡན་པའི་ཆོ་གས་སྦྱིན་པར་བྱའོ། །
en: Similarly, to all the gods and hosts of spirits, and all beings in general, he should offer cake products, particularly sweetmeats, incanted with the mantra according to procedure. {2.186}

source: དེ་བཞིན་དུ་མེ་ཏོག་དྲི་ཞིམ་པ་སྣ་མའི་མེ་ཏོག་དང་རྒྱ་སྤོས་དང་། ཀླུའི་མེ་ཏོག་དང་མེ་ཏོག་པུན་ནཱ་ག་ལ་སོགས་པ་སྔར་བསྟན་པ་སངས་རྒྱས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་འཕགས་པ་ཉན་ཐོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་དང་འཕགས་པ་དང་འཕགས་པ་མ་ཡིན་པའི་ལྷ་ཐམས་ཅད་ལ་དབུལ་བར་བྱའོ། །
en: “Similarly, to all the buddhas, pratyeka­buddhas, noble śrāvakas, and great bodhisattvas as well as all noble and ordinary beings he should offer fragrant flowers as described before, starting with royal jasmine, crepe jasmine, champak, and the blossom of the pannay tree.

source: ཁྱད་པར་དུ་ནི་དེ་བཞིན་གཤེགས་པའི་རིགས་ལ་ནི་སྣ་མའི་མེ་ཏོག་དང་། པདྨའི་རིགས་ལ་ནི་མེ་ཏོག་པདྨ་དང་། དེ་བཞིན་དུ་རྡོ་རྗེའི་རིགས་ལ་ནི་མེ་ཏོག་ཨུཏྤལ་དང་།
en: Royal jasmine flowers are particularly suitable for the Tathāgata family , lotuses for the Lotus family , and water lilies for the family of Vajrapāṇi.

source: ལྷ་གཞན་དག་ལ་ནི་གཞན་གང་ཡང་རུང་བས་དབུལ་བར་བྱའོ། །
en: For other mantra deities other flowers may be suitable. {2.187}

source: ག་པུར་གྱི་བདུག་པ་ནི་དེ་བཞིན་གཤེགས་པའི་རིགས་ལའོ། །
en: “Camphor incense is suitable for the Tathāgata family ,

source: ཙནྡན་ནི་པདྨའི་རིགས་ལའོ། །
en: sandalwood for the Lotus family,

source: དེ་བཞིན་དུ་གུ་གུལ་ནི་གསང་བའི་བདག་པོ་ཕྱག་ན་རྡོ་རྗེ་ལ་ཤེས་པར་བྱའོ། །
en: and bdellium for the family of Vajrapāṇi, the lord of guhyakas.

source: ལྷ་གཞན་ཐམས་ཅད་ནི་བདུག་པ་ཐ་མལ་པས་བྱའོ། །
en: For all other mantra deities the master should offer a different incense.

source: མར་གྱི་མར་མེ་འཕགས་པ་རྣམས། །ཐམས་ཅད་ལ་ནི་དབུལ་བར་བྱ། །
en: Butter lamps should be offered to all the noble ones,

source: འཕགས་མིན་ལྷ་ནི་ཐམས་ཅད་ལ། །དྲི་ཞིམ་འབྲུ་མར་དབུལ་བར་བྱ། །
en: and scented oil lamps to all the ordinary mantra deities. {2.188}

source: ཆོ་ག་ཇི་བཞིན་རིམ་པས་ནི། །
en: “As for the successive procedures

source: དེ་ལྟར་གསུངས་པ་དེ་བཞིན་དྲི། །
en: That function as previously described,

source: སྤྱན་རས་གཟིགས་ལ་གང་གསུངས་དང་། །གང་གསུངས་ཕྱག་ན་རྡོ་རྗེ་ལ། །རང་རང་གི་ནི་སྔགས་དག་གིས། །སྔགས་སྤྱོད་དོན་དུ་བསྒྲུབ་པའོ། །
en: “Whatever has been taught by Avalokiteśvara Or taught by Vajrapāṇi, In their respective tantras, On accomplishing the aims of mantra practice,

source: ཆོ་ག་གཅིག་པུ་བལྟ་བྱ་སྟེ། །རྟག་ཏུ་རྗེས་སུ་མཐུན་པར་བྱ། །
en: That also can be learned from this manual And applied in every respect. {2.190}

source: དེ་ནས་དཀྱིལ་འཁོར་གྱི་སློབ་དཔོན་གྱིས་སྔར་མཐོང་བའི་ཆོ་གས་སྤྱན་དྲང་བ་དང་། མཆོད་པ་དང་བདུག་པ་ལ་སོགས་པ་བྱས་ནས། གཙོར་མཐུན་པའི་བྱ་བ་བྱས་ཏེ་
en: “The maṇḍala master then, following the previously described procedure, should perform the ritual acts of summoning, making offerings, burning incense, and the rest, and he should offer food and service as well.

source: དེའི་འོག་ཏུ་སྒྲུབ་པའི་གྲོགས་མཆོག་གིས་མཁས་པ་དང་། མྱུར་བས་འབྱུང་པོ་ཐམས་ཅད་པའི་གཏོར་མ་ཤ་མེད་པ།
en: Having done this, he should have his skillful assistants promptly prepare the meatless bali for all the spirits.

source: ཀུན་ནས་རྔ་པ་ཊ་ཧ་དང་དུང་གི་སྒྲ་དགའ་བའི་སྒྲ་སྒྲོགས་པ་ལ་སོགས་པ་དེས་བདུག་པ་དང་སྤོས་དང་མེ་ཏོག་དང་ཕྲེང་བས་བརྒྱན་པའི་ཕྱོགས་བཞི་མཚམས་བརྒྱད་སྟེང་དང་འོག་དང་ཐད་ཀ་ཐམས་ཅད་དུ་དཀྱིལ་འཁོར་གྱི་ཕྱི་རོལ་དུ་བསྐོར་བ་བྱ་ཞིང་། འབྱུང་པོ་ཐམས་ཅད་པའི་གཏོར་མ་རྒྱ་ཆེར་གཏོང་བར་བྱའོ། །
en: He should have them beat the kettledrums, blow the conchs, and utter cries of joy in every direction. The bali should include incense, flowers, lamps, and garlands. {2.191} “Circling then the maṇḍala to the right, the master should scatter the extensive bali that satisfies all spirits, upward, downward, and horizontally, into each of the four cardinal and four intermediate directions and everywhere outside the maṇḍala.

source: དེ་ནས་ཁྲུས་བྱས་ཏེ་ཡང་ཞོ་དང་སྦྲང་རྩི་དང་། མར་གྱིས་བསྒོས་པའི་སཱ་ལུ་དང་། འབྲས་ཐུག་པོ་ཆེའི་སྦྱིན་སྲེག་རྩ་བའི་སྔགས་ཡི་གེ་དྲུག་པ་དང་སྙིང་པོས་སྟོང་རྩ་བརྒྱད་བྱའོ། །སྦྱིན་སྲེག་བྱས་ནས་
en: After bathing, he should offer into the fire one thousand and eight oblations consisting of rice grains smeared with curds, honey, and ghee. As the master offers the oblations while reciting the heart mantra and the six-syllable root mantra,

source: དཀྱིལ་འཁོར་ལ་རྗེས་སུ་བཅུག་ཅིང་སྔར་བཞག་པའི་སེམས་དཔའ་ཆེན་པོ་ལ་སྲུང་བ་བྱས་ནས། དཀྱིལ་འཁོར་གྱི་སློབ་དཔོན་གྱི་སློབ་མ་ཉིད་དུ་ཁས་བླངས་པ།
en: the great beings who have entered the maṇḍala and now stand before him; who have had the protection rite performed for them and have been accepted as disciples by the maṇḍala master;

source: བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་གསོ་སྦྱོང་བྱས་པ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ལ་བདག་ཉིད་ཀྱི་ལུས་ཕུལ་བ།
en: who have developed bodhicitta, observed the ritual fast, and offered their own bodies to all the buddhas and bodhisattvas;

source: དངོས་གྲུབ་ཀྱི་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉེ་བར་ལོངས་སྤྱོད་པ་དང་ཡོངས་སུ་ལོངས་སྤྱོད་པ་ཐུན་མོང་དུ་གྱུར་པ་དང་།
en: who for the sake of spiritual accomplishments share in the experiences of ordinary beings;

source: དགེ་བའི་རྩ་བ་བླ་ན་མེད་པའི་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་གནོན་པར་བྱ་བ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་སངས་རྒྱས་ཐོབ་པར་བྱ་བ་ལ་དཀྱིལ་འཁོར་བསྟན་པར་བྱའོ། །བསྟན་པ་ཙམ་ཉིད་ཀྱིས་སྡིག་པའི་རྙོག་པ་ཐམས་ཅད་ལས་གྲོལ་བར་འགྱུར་ཏེ།
en: who are fit to ascend to the seat of unsurpassable awakening; and who desire omniscient awakening will become liberated from all their vices through merely beholding the maṇḍala.

source: མཚམས་མེད་པ་ལྔ་བྱེད་པའི་སྐྱེ་བོ་ཡང་དེ་མ་ཐག་ཏུ་གྲོལ་བར་འགྱུར་རོ། །
en: Even those people who have committed the five deeds of immediate retribution are immediately liberated. {2.192}

source: དེ་ནས་དཀྱིལ་འཁོར་གྱི་སློབ་དཔོན་གྱིས་རས་མ་ཉམས་པ་ཐག་མས་བཏགས་མ་ཐག་པ་སྐྲ་མེད་པ་ལ། རྩ་བའི་སྔགས་ཀྱིས་ལན་གསུམ་བཟླས་ཏེ། དྲི་ཞིམ་པོའི་ཙནྡན་དང་གུར་གུམ་གྱིས་བསྒོས་པའི་རས་ཀྱིས་གདོང་གཡོགས་པར་བྱའོ། །
en: “The maṇḍala master then should cover the faces of the initiands who wish to enter the maṇḍala with a veil fashioned from a newly made, unbleached cloth from which the loose threads have been pulled out and hairs removed, that has been incanted with the root mantra seven times, and that has been anointed with fragrant ointments, sandalwood, and saffron.

source: དང་པོར་བྱིས་པ་ལོ་གསུམ་ནས་ལོ་བཅུ་དྲུག་པའི་བར་ཟུར་ཕུད་ལྔས་ཉེ་བར་མཛེས་པའམ།
en: First, boys should be brought into the maṇḍala starting from the sixteen- and finishing with the three-year-olds.

source: གཙུག་ཕུད་གཅིག་གིས་ཉེ་བར་མཛེས་པའམ། གཙུག་ཕུད་གསུམ་གྱིས་ཉེ་བར་མཛེས་པ་སྐྲ་དང་ལྡན་པ། རྒྱལ་པོའི་བུ་སྤྱི་བོ་ནས་དབང་བསྐུར་བའམ།
en: They may be embellished with either five decorative locks of hair or just one, and they may wear a topknot of hair or not.

source: རྒྱལ་རིགས་ཀྱི་བུའམ་གཞན་བདག་ཉིད་ཆེན་པོ་རྒྱལ་པོ་ཆེན་པོ་འདོད་པ་དཀྱིལ་འཁོར་དུ་གཞུག་པར་བྱའོ། །
en: They should be princes whose crowns have been anointed, sons of kṣatriyas, or others of great endeavor who desire sovereignty. {2.193}

source: དཀྱིལ་འཁོར་གཉིས་པ་ལ་ཕྱིན་པ་ན་གདོང་གཡོགས་པར་བྱ་སྟེ།
en: “When the initiand stands in the second maṇḍala with a veiled face,

source: ཨུཏྤ་ལའི་ཕྱག་རྒྱ་བཅིངས་ནས། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྩ་བའི་སྔགས་ལན་ཅིག་བརྗོད་དུ་གཞུག་སྟེ།
en: the master should form the utpala mudrā and have him recite the root mantra of Mañjuśrī, the divine youth, once.

source: མེ་ཏོག་དྲི་ཞིམ་པོ་ཙནྡན་དང་གུར་གུམ་དང་བསྲེས་པ་ཤིན་ཏུ་གཙང་བར་བྱས་པ། ལག་པ་གཉིས་སུ་བྱིན་ལ་མེ་ཏོག་འདོར་དུ་གཞུག་གོ། །
en: Guiding his actions, he should give him a flower of nice fragrance and have him throw it onto the maṇḍala with both hands that have been purified with the mixture of sandalwood and saffron.

source: གང་དུ་དེའི་མེ་ཏོག་བབས་པ་དེར་དེའི་སྔགས་སྦྱིན་པར་བྱ་སྟེ།
en: The master should give him the mantra corresponding to the spot where the flower falls. {2.194}

source: སྔགས་འདི་ནི་དེའི་ཡིན་པར་བསྟན་ཏེ། སྐྱེ་བ་བརྒྱུད་པ་ནས་དེ་དང་རྗེས་སུ་འབྲེལ་པ་ཡིན་ཏེ།
en: “That is said to be his personal mantra and will stay with him through the succession of his future births.
